<template>
  <div class="ukraine">
    <h2>Украина</h2>
    <div class="description">
      <img src="../assets/karta-ukrainy.jpg" alt="Map" class="description__map">
      <h4>15 фактов об Украине</h4>
      <ul>
        <li>Украина – самая большая страна в Европе. Ее площадь − 603 628 км².</li>
        <li>Украинская трембита − самый длинный духовой музыкальный инструмент в мире.</li>
        <li>Одна из самых известных в мире рождественских песен – это «Щедрик», народная песня, 
          записанная украинским композитором Николаем Леонтовичем.  
          Мир знает ее как Carol of the Bells или Ring Christmas Bells.</li>
        <li>Украина занимает четвертое место в мире по количеству граждан с высшим образованием. 
          Количество людей с высшим образованием на душу населения выше среднеевропейского уровня.</li>
        <li>Станция метро «Арсенальная» в Киеве − самая глубокая в мире. 
          Она уходит под землю на 105 м. Станцию построили одной из первых − в 1960 году.</li>
        <li>До разрушения монголо-татарами в 1240 году Киев был одним из крупнейших городов Европы, 
          в пятьдесят раз больше Лондона и в десять – Парижа.</li>
        <li>Крещатик – самая короткая центральная улица столицы в Европе. Ее длина составляет 1225 м.</li>
        <li>На территории Украины сосредоточена четверть всех запасов чернозема на Земле. 
           Украина является одним из крупнейших экспортеров зерна в мире.</li>
        <li>Первую в мире конституцию приняли в Украине 5 апреля 1710 года.
           Сделал это Пилип Орлик, гетьман Запорожского войска, она называлась «Конституция прав и свобод войска Запорожского». 
           В США Конституцию приняли в 1787-м, Во Франции и Польше – только в 1791-м.</li>
        <li>В Черном море обнаружили единственную в мире подводную реку.
          Река переносит колоссальные объемы воды – 22 000 м3/сек. 
          Если бы эта река находилась на суше, то занимала бы шестое место в мире по этому показателю.
          Водный поток образован проникновением через пролив Босфор более соленой воды Мраморного моря в менее соленую среду Черного моря.</li>
        <li>В городке Рахов, что в живописных Карпатах, находится географический центр Европы.</li>
        <li>Острожская академия – первое высшее учебное заведение в Восточной Европе. 
          Его в 1576 оду основал князь Острожский Константин-Василий. </li>
        <li>Площадь Свободы в Харькове – самая большая в Европе. Ее протяженность достигает 750 м, а ширина – 125 м.</li>
        <li>Из шести мужских монастырей в мире, которые имеют статус лавры, три находятся в Украине. 
          Это Свято-Успенская Киево-Печерская Лавра в Киеве, 
          Свято-Успенская Лавра в Почаеве и Святогорская Свято-Успенская Лавра в Донецкой области.</li>
        <li>Среди украинских городов больше всего заведений общественного питания на душу населения 
          во Львове — 1500 при населении  ~ 730 тыс. человек. </li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  name: "Ukraine",
};
</script>

<style scoped lang="scss">
.ukraine {
  background: linear-gradient(0deg, rgba(253,208,45,1) 0%, rgba(45,182,253,1) 100%);
}
h2 {
  margin: 0;
}
img {
  transition: all 2s ease-in-out;
}
img:hover {
  transform: rotate(360deg);
}
.description {
  display: block;

  &__map {
    width: 400px;
    height: auto;
    margin: 10px;
  }
  ul {
    width: 90%;
    margin-left: 20px;
  }
  li {
    list-style: square;
    text-align: left;
  }
}
</style>